{
  "menu": {
    "Home": "",
    "Resume": "Resume",
    "Work": "Work",
    "Contact": "Contact"
  },
  "home": {
    "title": "Hello, I'm ",
    "name": "Matteo",
    "subtitle": "I build elegant",
    "subtitle2": "full-stack",
    "subtitle3": "apps."
  },
  "footer": {
    "text": "All rights reserved."
  },
  "lang": "Swap language to",
  "cv": "Download CV",
  "hire": "Hire me",
  "login_chat": "Login to chat",
  "login_error": "Authentication failed. Please try again or with a different provider.",
  "chat": "Chat with me",
  "chat_placeholder": "Type your message...",
  "chat_me": "Chat with Matteo",
  "close_chat": "Close chat",
  "like": {
    "popup": "Like this project",
    "remove_popup": "Remove like",
    "success": "Thanks for the ❤️",
    "success_description": "Your appreciation has been recorded.",
    "removed": "Ohh nooo, ❤️ removed",
    "removed_description": "You can like it again any time.",
    "error": "Couldn’t send like",
    "error_description": "Please try again later."
  },
  "login_like": "Login to like",
  "live": "Live demo",
  "source": "View on GitHub",
  "theme": "Switch theme",
  "resume": {
    "title": "Why hire me?",
    "subtitle": "Building performant and responsive web applications for the modern web.",
    "menu": {
      "experience": "Experience",
      "education": "Education",
      "skills": "Skills",
      "about": "About Me"
    },
    "experience": {
      "title": "Professional Experience",
      "subtitle": "From UI to database, I’ve worked across the stack to build fast, modern web apps that users enjoy."
    },
    "education": {
      "title": "My education",
      "subtitle": "Studied science in high school, then jumped into web dev through a bootcamp."
    },
    "skills": {
      "title": "Tech Stack",
      "subtitle": "I build fast, responsive UIs with React and Tailwind, handle backend logic with Node.js and PostgreSQL, and cover auth, testing, and deployment with tools like JWT, Vitest, and AWS."
    },
    "about": {
      "title": "About Me",
      "subtitle": "I’ve been passionate about technology since childhood; I always loved exploring, hacking and repairing all kinds of devices.",
      "Name": "Name",
      "Phone": "Phone",
      "Email": "Email",
      "LinkedIn": "LinkedIn",
      "GitHub": "GitHub",
      "Experience": "Experience",
      "Experience_value": "{{years}}+ years",
      "Nationality": "Nationality",
      "Languages": "Languages",
      "Nationality_value": "Italian",
      "Languages_value": "English, Spanish"
    }
  },
  "work": {
    "title": "Work",
    "neura-nft": {
      "description": "NeuraNFT is a cross-platform mobile DApp where users can connect their wallet, view tokens and transactions, and mint custom or AI-generated NFTs powered by OpenAI, with metadata stored on Pinata IPFS."
    },
    "mind-earth": {
      "description": "A full-stack geospatial platform built with Next.js, FastAPI, PostgreSQL, and Docker. Mind Earth lets you explore geo-data, population stats, and manage authentication seamlessly."
    },
    "file-upload": {
      "description": "A simple file upload and management app supporting PDFs, images, and videos. Features a responsive table with file previews."
    },
    "full-stack-portfolio": {
      "description": "Personal portfolio built with full-stack technologies."
    },
    "blendon-barber-shop": {
      "description": "Professional website with booking system for a local barbershop."
    },
    "ags-illuminazione": {
      "description": "Corporate website for a lighting company."
    },
    "world-emissions-clock": {
      "description": "An interactive tool forecasting sectoral greenhouse gas emissions across 182 countries under three global scenarios: business as usual, full NDC implementation, and a 1.5°C goal. It visualizes future pathways by country and sector, enabling transparent, data-driven comparisons to inform climate action."
    },
    "internet-poverty-index": {
      "description": "A data-driven tool measuring global digital inequality based on affordability, quantity, and quality of mobile internet. It highlights how many people cannot afford 1GB of data per month at 10 Mbps speed, raising awareness about internet access as a basic need."
    },
    "africa-youth-clock": {
      "description": "Built with the World Data Lab and Mastercard Foundation, is a first-of-its-kind tool that monitors and forecasts youth employment trends across 54 African countries through 2030."
    },
    "africa-social-protection": {
      "description": "An interactive tool that projects social protection coverage across Africa, tracking progress toward the AU’s 40% target by 2025. It visualizes three scenarios—status quo, pessimistic, and goal-achieving—to guide policy and investment decisions."
    },
    "water-crisis-clock": {
      "description": "An interactive platform showing global water scarcity and ecosystem decline, projecting trends to 2050 and highlighting links between water, climate, and biodiversity."
    },
    "categories-clock": {
      "description": "A data-driven tool that forecasts global consumer demand across 240+ categories—from food to beauty—up to 2034. Built for companies like Coca-Cola and L’Oréal, it enables precise market sizing by demographic and location."
    }
  },
  "contact": {
    "title": "Contact",
    "subtitle": "I’d love to hear from you! Whether you have a question, want to collaborate, or just want to say hi — fill out the form below and I’ll get back to you shortly.",
    "name": {
      "label": "Name",
      "placeholder": "Your name"
    },
    "message": {
      "label": "Message",
      "placeholder": "Your message"
    },
    "email": {
      "label": "Email",
      "placeholder": "Your email"
    },
    "privacy": {
      "one": "I agree to the",
      "two": "privacy policy",
      "three": "and",
      "four": "terms of service"
    },
    "sending": "Sending...",
    "send": "Send message",
    "success": {
      "title": "Message sent successfully!",
      "description": "I’ll get back to you soon."
    },
    "error": {
      "title": "Something went wrong",
      "description": "If the issue persists, contact me directly."
    }
  },
  "modal": {
    "subtitle": "Choose a provider to continue",
    "privacy": {
      "one": "By continuing, you agree to the ",
      "two": "Terms of Service",
      "three": "Privacy Policy",
      "four": "For Facebook users, see",
      "five": "how to delete your data",
      "six": "and"
    }
  },
  "info": {
    "duties": "Key Duties",
    "tech": "Technologies",
    "projects": "Projects",
    "world-data-lab": {
      "duties": [
        "Built responsive web applications delivering real-time data and projections out to 2030",
        "Developed models for data visualization on various global issues such as population, hunger, poverty, and water shortage"
      ]
    },
    "hydrogrid": {
      "duties": [
        "Designed and continually maintained Hydrogrid’s two dashboards:",
        "One dashboard provided clients with real-time electricity production data of their hydropower assets in a graphical format. Clients could edit parameters to maximize their profit",
        "The other dashboard was an internal company product for staging new customers or simulation plants",
        "Used the latest version of React.js with Hooks to ensure the dashboards were interactive, secure, and fast"
      ]
    },
    "eis-world": {
      "duties": [
        "Developed websites from scratch using modern web technologies",
        "Managed Git merges as team lead",
        "Handled backend with PHP and MySQL, including PDF generation"
      ]
    },
    "loro-piana": {
      "duties": [
        "Contributed to building a new e-commerce platform from scratch, focusing on front-end design changes and interactions",
        "Focused on UI/UX and WCAG accessibility standards"
      ]
    },
    "videosmart": {
      "duties": [
        "Created responsive HTML5 landing pages and email templates based on specified designs",
        "Ensured cross-browser compatibility and responsiveness on various devices"
      ]
    }
  },
  "delete": {
    "title": "Facebook Data Deletion Instructions",
    "instructions": "If you signed in using Facebook and would like to request deletion of your data from our system, please send an email to",
    "emailSubject": "with the subject",
    "alternative": "Alternatively, you can use the",
    "finalNote": "on our website. We will process your request and remove all associated data from our records."
  },
  "terms": {
    "title": "Terms of Service",
    "intro": "By using the contact form on this website, you agree to the following terms and conditions.",
    "section1": {
      "title": "1. Use of the Website",
      "content": "This site and its login system are intended solely for real interactions such as chatting with Matteo, chatting with the AI, or liking projects. Spam, impersonation, or misuse will result in revoked access."
    },
    "section2": {
      "title": "2. Data Handling",
      "content1": "When you log in using Google, GitHub, LinkedIn, or Slack, we collect your name, email, and avatar. Likes and user identity are stored permanently unless requested for removal. Admin chat messages are deleted after 10 days. AI chat messages are stored in your browser and are also deleted after 10 days.",
      "content2": "For more details, see our"
    },
    "section3": {
      "title": "3. Limitation of Use",
      "content": "We reserve the right to ignore or delete any interaction that is irrelevant, abusive, or off-purpose."
    },
    "section4": {
      "title": "4. Changes to These Terms",
      "content": "These terms may be updated at any time. The latest version will always be visible on this page."
    },
    "section5": {
      "title": "5. Data Deletion Request",
      "content": "You may request the deletion of your personal data at any time by using the contact form on this website."
    },
    "privacyLink": "privacy policy",
    "deleteLink": "Data Deletion page",
    "effective": "Effective Date"
  },
  "privacy": {
    "title": "Privacy Policy",
    "intro": "This Privacy Policy explains how your personal data is collected, used, and protected when you interact with this portfolio website.",
    "section1": {
      "title": "1. What We Collect",
      "description": "We collect:",
      "list": [
        "Login via Google, GitHub, Slack, or LinkedIn: name, email, avatar",
        "Project likes",
        "Chat messages: admin messages stored in a secure DB and deleted after 10 days, AI messages stored only in your browser and also deleted after 10 days"
      ]
    },
    "section2": {
      "title": "2. Why We Collect It",
      "description": "To:",
      "list": [
        "Authenticate users",
        "Enable real-time chat and project likes",
        "Prevent abuse and ensure fair use"
      ],
      "disclaimer": "We do not use your data for marketing or share it with third parties."
    },
    "section3": {
      "title": "3. How Your Data Is Stored",
      "description": "User data and likes are securely stored. Admin chats are deleted after 10 days. AI messages never leave your browser and are deleted locally after 10 days."
    },
    "section4": {
      "title": "4. Your Rights",
      "description": "You can request access or deletion of your data any time using the contact form."
    },
    "section5": {
      "title": "5. Contact",
      "description": "If you have questions or requests, please use the contact form."
    },
    "effectiveDate": "Effective Date"
  },
  "easter": {
    "title": "🥚 You found the Easter Egg!",
    "description": "Well done, you clicked the right spot 😎"
  },
  "not_found": {
    "title": "Lost in space 🧭",
    "description": "This page doesn’t exist. Maybe you took a wrong turn?",
    "suggestion": "Don’t worry — we’ll get you back on track.",
    "contact": "If you believe this is a mistake, please ",
    "contact_me": "contact me",
    "button": "Back to homepage"
  },
  "error": {
    "title": "Oh no, something went wrong",
    "working": "Our developers",
    "emoji": "🧑‍💻🧑‍💻🧑‍💻",
    "message": "are working hard to solve this problem.",
    "suggestion": "If the issue continues, please ",
    "contact_me": "get in touch",
    "button": "Go to homepage"
  },
  "loading": "Loading...",
  "cancel_policy": "Messages will be deleted automatically after 10 days from our servers and your browser. Want to remove earlier? Contact me from the contact form.",
  "toast": {
    "title": "Info"
  },
  "logout": {
    "success": "Successfully logged out",
    "error": "An error occurred while logging out"
  },
  "info_provider": "✅ Google and LinkedIn are the simplest. Just log in with your email and password.\n⚠️ GitHub requires a public email in your profile to work properly.\n🧩 Slack asks you to choose or log into a Slack workspace first. If you don’t have one, Slack login won’t work.",
  "search": {
    "title": "Search",
    "description": "Filter projects and work experience by technology, roles, location, or company.",
    "info": "Select a category from the dropdown to add filters. You can filter by multiple categories, one at a time.",
    "category": "Search category...",
    "value": "Search...",
    "selected": "selected",
    "select_category": "Select category",
    "select": "Select",
    "no_results": "No results found",
    "no_results_subtitle": "Try changing the filters",
    "results_title": "Selected for You",
    "found_result_one": "{{count}} result found",
    "found_result_other": "{{count}} results found",
    "based_on_filters": "Based on your filters",
    "click_for_more": "Click an item to view more details"
  },
  "close_modal": "Close modal",
  "open": "open",
  "close": "Close",
  "confirm": "Confirm",
  "clear": "Reset all"
}
